reversalxml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <p272:ViewBillPaymentDetailsRequest xmlns:p272="http://barclays.com/bem/ViewBillPaymentDetails">
            <p272:RequestHeader>
                <ConsumerContext p56:RESP_POPULATE_FLAG="0" xmlns:p56="http://barclays.com/bem/BEMServiceHeader">
                    <CountryCode>ZM</CountryCode>
                    <SystemID>MNO</SystemID>
                    <BusinessID>ZMBRB</BusinessID>
                    <BranchCode>009</BranchCode>
                    <TerminalID>101</TerminalID>
                </ConsumerContext>
                <ServiceContext>
                    <ServiceID>ViewBillPaymentDetails</ServiceID>
                    <ConsumerUniqueRefNo>432710734297</ConsumerUniqueRefNo>
                    <OriginalConsumerUniqueRefNo>218507076786931935</OriginalConsumerUniqueRefNo>
                    <ServiceDateTime>2024-12-25T07:07:28.708Z</ServiceDateTime>
                    <ServiceVersionNo>6.0.0</ServiceVersionNo>
                    <OverrideRequestFlag>false</OverrideRequestFlag>
                </ServiceContext>
                <BankUserContext p56:RESP_POPULATE_FLAG="1" xmlns:p56="http://barclays.com/bem/BEMServiceHeader">
                    <StaffType>Regular</StaffType>AQ
                    <StaffID>IFE</StaffID>
                    <AuthorizerID>Z00019789</AuthorizerID>
                </BankUserContext>
                <CustomerContext p56:RESP_POPULATE_FLAG="0" xmlns:p56="http://barclays.com/bem/BEMServiceHeader">
                    <CustomerType>Retail</CustomerType>
                    <ConsumerAccessID>zbsit1010</ConsumerAccessID>
                    <MasterCIFID>100000216518</MasterCIFID>
                    <CustomerNumber>210007961</CustomerNumber>
                    <CorpUserID>2222</CorpUserID>
                </CustomerContext>
            </p272:RequestHeader>
            <p272:ViewBillPaymentInfo>
                <p272:TransactionReferenceNumber>432710734297</p272:TransactionReferenceNumber>
            </p272:ViewBillPaymentInfo>
        </p272:ViewBillPaymentDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>
